load-test/results/quick_stress-pod-2026-01-14-0124.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/k6-profiles.js
        output: -

     scenarios: (100.00%) 1 scenario, 45 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 45 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-01-14T06:21:32Z" level=info msg="\n=== Load Test: quick_stress ===" source=console
time="2026-01-14T06:21:32Z" level=info msg="Target: http://kata-deploy-sandbox-service.kata-system:8080" source=console
time="2026-01-14T06:21:32Z" level=info msg="Total VUs: 45" source=console
time="2026-01-14T06:21:32Z" level=info msg="  occasional: 10" source=console
time="2026-01-14T06:21:32Z" level=info msg="  steady: 15" source=console
time="2026-01-14T06:21:32Z" level=info msg="  light_python: 10" source=console
time="2026-01-14T06:21:32Z" level=info msg="  heavy_python: 5" source=console
time="2026-01-14T06:21:32Z" level=info msg="  bursty: 5" source=console
time="2026-01-14T06:21:32Z" level=info msg="Service healthy\n" source=console
time="2026-01-14T06:21:33Z" level=info msg="VU 1: occasional" source=console

running (0m00.9s), 01/45 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/45 VUs  0m00.8s/3m00.0s
time="2026-01-14T06:21:34Z" level=info msg="VU 3: occasional" source=console

running (0m01.9s), 02/45 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/45 VUs  0m01.8s/3m00.0s
time="2026-01-14T06:21:34Z" level=info msg="VU 2: occasional" source=console
time="2026-01-14T06:21:35Z" level=info msg="VU 4: occasional" source=console

running (0m02.9s), 04/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/45 VUs  0m02.8s/3m00.0s
time="2026-01-14T06:21:36Z" level=info msg="VU 5: occasional" source=console

running (0m03.9s), 05/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 05/45 VUs  0m03.8s/3m00.0s
time="2026-01-14T06:21:36Z" level=info msg="VU 6: occasional" source=console
time="2026-01-14T06:21:37Z" level=info msg="VU 7: occasional" source=console

running (0m04.9s), 07/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 07/45 VUs  0m04.8s/3m00.0s
time="2026-01-14T06:21:38Z" level=info msg="VU 8: occasional" source=console

running (0m05.9s), 08/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 08/45 VUs  0m05.8s/3m00.0s
time="2026-01-14T06:21:38Z" level=info msg="VU 9: occasional" source=console
time="2026-01-14T06:21:39Z" level=info msg="VU 11: steady" source=console

running (0m06.9s), 10/45 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10/45 VUs  0m06.8s/3m00.0s
time="2026-01-14T06:21:40Z" level=info msg="VU 12: steady" source=console

running (0m07.9s), 11/45 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 11/45 VUs  0m07.8s/3m00.0s
time="2026-01-14T06:21:40Z" level=info msg="VU 13: steady" source=console
time="2026-01-14T06:21:41Z" level=info msg="VU 10: occasional" source=console

running (0m08.9s), 13/45 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 13/45 VUs  0m08.8s/3m00.0s
time="2026-01-14T06:21:42Z" level=info msg="VU 15: steady" source=console

running (0m09.9s), 14/45 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 14/45 VUs  0m09.8s/3m00.0s
time="2026-01-14T06:21:42Z" level=info msg="VU 16: steady" source=console
time="2026-01-14T06:21:43Z" level=info msg="VU 17: steady" source=console

running (0m10.9s), 16/45 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 16/45 VUs  0m10.8s/3m00.0s
time="2026-01-14T06:21:44Z" level=info msg="VU 14: steady" source=console

running (0m11.9s), 17/45 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 17/45 VUs  0m11.8s/3m00.0s
time="2026-01-14T06:21:44Z" level=info msg="VU 18: steady" source=console
time="2026-01-14T06:21:45Z" level=info msg="VU 19: steady" source=console

running (0m12.9s), 19/45 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 19/45 VUs  0m12.8s/3m00.0s
time="2026-01-14T06:21:46Z" level=info msg="VU 20: steady" source=console

running (0m13.9s), 20/45 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 20/45 VUs  0m13.8s/3m00.0s
time="2026-01-14T06:21:46Z" level=info msg="VU 21: steady" source=console
time="2026-01-14T06:21:47Z" level=info msg="VU 22: steady" source=console

running (0m14.9s), 22/45 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 22/45 VUs  0m14.8s/3m00.0s
time="2026-01-14T06:21:48Z" level=info msg="VU 23: steady" source=console

running (0m15.9s), 23/45 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 23/45 VUs  0m15.8s/3m00.0s
time="2026-01-14T06:21:48Z" level=info msg="VU 24: steady" source=console
time="2026-01-14T06:21:49Z" level=info msg="VU 25: steady" source=console

running (0m16.9s), 25/45 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 25/45 VUs  0m16.8s/3m00.0s
time="2026-01-14T06:21:50Z" level=info msg="VU 27: light_python" source=console

running (0m17.9s), 26/45 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 26/45 VUs  0m17.8s/3m00.0s
time="2026-01-14T06:21:50Z" level=info msg="VU 28: light_python" source=console
time="2026-01-14T06:21:51Z" level=info msg="VU 29: light_python" source=console

running (0m18.9s), 28/45 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 28/45 VUs  0m18.8s/3m00.0s
time="2026-01-14T06:21:52Z" level=info msg="VU 30: light_python" source=console

running (0m19.9s), 29/45 VUs, 2 complete and 0 interrupted iterations
default   [  11% ] 29/45 VUs  0m19.8s/3m00.0s
time="2026-01-14T06:21:52Z" level=info msg="VU 31: light_python" source=console
time="2026-01-14T06:21:53Z" level=info msg="VU 32: light_python" source=console

running (0m20.9s), 31/45 VUs, 3 complete and 0 interrupted iterations
default   [  12% ] 31/45 VUs  0m20.8s/3m00.0s
time="2026-01-14T06:21:54Z" level=info msg="VU 33: light_python" source=console

running (0m21.9s), 32/45 VUs, 4 complete and 0 interrupted iterations
default   [  12% ] 32/45 VUs  0m21.8s/3m00.0s
time="2026-01-14T06:21:54Z" level=info msg="VU 26: light_python" source=console
time="2026-01-14T06:21:55Z" level=info msg="VU 34: light_python" source=console

running (0m22.9s), 34/45 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 34/45 VUs  0m22.8s/3m00.0s
time="2026-01-14T06:21:56Z" level=info msg="VU 35: light_python" source=console

running (0m23.9s), 35/45 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 35/45 VUs  0m23.8s/3m00.0s
time="2026-01-14T06:21:56Z" level=info msg="VU 36: heavy_python" source=console
time="2026-01-14T06:21:57Z" level=info msg="VU 37: heavy_python" source=console

running (0m24.9s), 37/45 VUs, 12 complete and 0 interrupted iterations
default   [  14% ] 37/45 VUs  0m24.8s/3m00.0s
time="2026-01-14T06:21:58Z" level=info msg="VU 38: heavy_python" source=console

running (0m25.9s), 38/45 VUs, 13 complete and 0 interrupted iterations
default   [  14% ] 38/45 VUs  0m25.8s/3m00.0s
time="2026-01-14T06:21:58Z" level=info msg="VU 39: heavy_python" source=console
time="2026-01-14T06:21:59Z" level=info msg="VU 40: heavy_python" source=console

running (0m26.9s), 40/45 VUs, 16 complete and 0 interrupted iterations
default   [  15% ] 40/45 VUs  0m26.8s/3m00.0s
time="2026-01-14T06:22:00Z" level=info msg="VU 41: bursty" source=console

running (0m27.9s), 41/45 VUs, 24 complete and 0 interrupted iterations
default   [  15% ] 41/45 VUs  0m27.8s/3m00.0s
time="2026-01-14T06:22:00Z" level=info msg="VU 43: bursty" source=console
time="2026-01-14T06:22:01Z" level=info msg="VU 42: bursty" source=console

running (0m28.9s), 43/45 VUs, 26 complete and 0 interrupted iterations
default   [  16% ] 43/45 VUs  0m28.8s/3m00.0s
time="2026-01-14T06:22:02Z" level=info msg="VU 44: bursty" source=console

running (0m29.9s), 44/45 VUs, 28 complete and 0 interrupted iterations
default   [  17% ] 44/45 VUs  0m29.8s/3m00.0s
time="2026-01-14T06:22:02Z" level=info msg="VU 45: bursty" source=console

running (0m30.9s), 45/45 VUs, 32 complete and 0 interrupted iterations
default   [  17% ] 45/45 VUs  0m30.8s/3m00.0s

running (0m31.9s), 45/45 VUs, 36 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m31.8s/3m00.0s

running (0m32.9s), 45/45 VUs, 38 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m32.8s/3m00.0s

running (0m33.9s), 45/45 VUs, 41 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m33.8s/3m00.0s

running (0m34.9s), 45/45 VUs, 48 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m34.8s/3m00.0s

running (0m35.9s), 45/45 VUs, 52 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m35.8s/3m00.0s

running (0m36.9s), 45/45 VUs, 54 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m36.8s/3m00.0s

running (0m37.9s), 45/45 VUs, 57 complete and 0 interrupted iterations
default   [  21% ] 45/45 VUs  0m37.8s/3m00.0s

running (0m38.9s), 45/45 VUs, 60 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m38.8s/3m00.0s

running (0m39.9s), 45/45 VUs, 63 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m39.8s/3m00.0s

running (0m40.9s), 45/45 VUs, 66 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m40.8s/3m00.0s

running (0m41.9s), 45/45 VUs, 71 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m41.8s/3m00.0s

running (0m42.9s), 45/45 VUs, 74 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m42.8s/3m00.0s

running (0m43.9s), 45/45 VUs, 81 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m43.8s/3m00.0s

running (0m44.9s), 45/45 VUs, 84 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m44.8s/3m00.0s

running (0m45.9s), 45/45 VUs, 87 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m45.8s/3m00.0s

running (0m46.9s), 45/45 VUs, 89 complete and 0 interrupted iterations
default   [  26% ] 45/45 VUs  0m46.8s/3m00.0s

running (0m47.9s), 45/45 VUs, 93 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m47.8s/3m00.0s

running (0m48.9s), 45/45 VUs, 94 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m48.8s/3m00.0s

running (0m49.9s), 45/45 VUs, 97 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m49.8s/3m00.0s

running (0m50.9s), 45/45 VUs, 105 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m50.8s/3m00.0s

running (0m51.9s), 45/45 VUs, 109 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m51.8s/3m00.0s

running (0m52.9s), 45/45 VUs, 115 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m52.8s/3m00.0s

running (0m53.9s), 45/45 VUs, 126 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m53.8s/3m00.0s

running (0m54.9s), 45/45 VUs, 130 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m54.8s/3m00.0s

running (0m55.9s), 45/45 VUs, 132 complete and 0 interrupted iterations
default   [  31% ] 45/45 VUs  0m55.8s/3m00.0s

running (0m56.9s), 45/45 VUs, 135 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m56.8s/3m00.0s

running (0m57.9s), 45/45 VUs, 137 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m57.8s/3m00.0s

running (0m58.9s), 45/45 VUs, 141 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m58.8s/3m00.0s

running (0m59.9s), 45/45 VUs, 146 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m59.8s/3m00.0s

running (1m00.9s), 45/45 VUs, 149 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m00.8s/3m00.0s

running (1m01.9s), 45/45 VUs, 158 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m01.8s/3m00.0s

running (1m02.9s), 45/45 VUs, 160 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m02.8s/3m00.0s

running (1m03.9s), 45/45 VUs, 163 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m03.8s/3m00.0s

running (1m04.9s), 45/45 VUs, 169 complete and 0 interrupted iterations
default   [  36% ] 45/45 VUs  1m04.8s/3m00.0s

running (1m05.9s), 45/45 VUs, 172 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m05.8s/3m00.0s

running (1m06.9s), 45/45 VUs, 174 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m06.8s/3m00.0s

running (1m07.9s), 45/45 VUs, 179 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m07.8s/3m00.0s

running (1m08.9s), 45/45 VUs, 182 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m08.8s/3m00.0s

running (1m09.9s), 45/45 VUs, 187 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m09.8s/3m00.0s

running (1m10.9s), 45/45 VUs, 192 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m10.8s/3m00.0s

running (1m11.9s), 45/45 VUs, 197 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m11.8s/3m00.0s

running (1m12.9s), 45/45 VUs, 202 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m12.8s/3m00.0s

running (1m13.9s), 45/45 VUs, 205 complete and 0 interrupted iterations
default   [  41% ] 45/45 VUs  1m13.8s/3m00.0s

running (1m14.9s), 45/45 VUs, 210 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m14.8s/3m00.0s

running (1m15.9s), 45/45 VUs, 215 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m15.8s/3m00.0s

running (1m16.9s), 45/45 VUs, 218 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m16.8s/3m00.0s

running (1m17.9s), 45/45 VUs, 223 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m17.8s/3m00.0s

running (1m18.9s), 45/45 VUs, 226 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m18.8s/3m00.0s

running (1m19.9s), 45/45 VUs, 230 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m19.8s/3m00.0s

running (1m20.9s), 45/45 VUs, 234 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m20.8s/3m00.0s

running (1m21.9s), 45/45 VUs, 241 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m21.8s/3m00.0s

running (1m22.9s), 45/45 VUs, 244 complete and 0 interrupted iterations
default   [  46% ] 45/45 VUs  1m22.8s/3m00.0s

running (1m23.9s), 45/45 VUs, 249 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m23.8s/3m00.0s

running (1m24.9s), 45/45 VUs, 254 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m24.8s/3m00.0s

running (1m25.9s), 45/45 VUs, 257 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m25.8s/3m00.0s

running (1m26.9s), 45/45 VUs, 259 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m26.8s/3m00.0s

running (1m27.9s), 45/45 VUs, 262 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m27.8s/3m00.0s

running (1m28.9s), 45/45 VUs, 265 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m28.8s/3m00.0s

running (1m29.9s), 45/45 VUs, 270 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m29.8s/3m00.0s

running (1m30.9s), 45/45 VUs, 277 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m30.8s/3m00.0s

running (1m31.9s), 45/45 VUs, 279 complete and 0 interrupted iterations
default   [  51% ] 45/45 VUs  1m31.8s/3m00.0s

running (1m32.9s), 45/45 VUs, 282 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m32.8s/3m00.0s

running (1m33.9s), 45/45 VUs, 284 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m33.8s/3m00.0s

running (1m34.9s), 45/45 VUs, 288 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m34.8s/3m00.0s

running (1m35.9s), 45/45 VUs, 293 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m35.8s/3m00.0s

running (1m36.9s), 45/45 VUs, 301 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m36.8s/3m00.0s

running (1m37.9s), 45/45 VUs, 304 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m37.8s/3m00.0s

running (1m38.9s), 45/45 VUs, 312 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m38.8s/3m00.0s

running (1m39.9s), 45/45 VUs, 316 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m39.8s/3m00.0s

running (1m40.9s), 45/45 VUs, 318 complete and 0 interrupted iterations
default   [  56% ] 45/45 VUs  1m40.8s/3m00.0s

running (1m41.9s), 45/45 VUs, 321 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m41.8s/3m00.0s

running (1m42.9s), 45/45 VUs, 322 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m42.8s/3m00.0s

running (1m43.9s), 45/45 VUs, 326 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m43.8s/3m00.0s

running (1m44.9s), 45/45 VUs, 327 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m44.8s/3m00.0s

running (1m45.9s), 45/45 VUs, 336 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m45.8s/3m00.0s

running (1m46.9s), 45/45 VUs, 341 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m46.8s/3m00.0s

running (1m47.9s), 45/45 VUs, 345 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m47.8s/3m00.0s

running (1m48.9s), 45/45 VUs, 347 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m48.8s/3m00.0s

running (1m49.9s), 45/45 VUs, 351 complete and 0 interrupted iterations
default   [  61% ] 45/45 VUs  1m49.8s/3m00.0s

running (1m50.9s), 45/45 VUs, 355 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m50.8s/3m00.0s

running (1m51.9s), 45/45 VUs, 360 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m51.8s/3m00.0s

running (1m52.9s), 45/45 VUs, 363 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m52.8s/3m00.0s

running (1m53.9s), 45/45 VUs, 367 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m53.8s/3m00.0s

running (1m54.9s), 45/45 VUs, 374 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m54.8s/3m00.0s

running (1m55.9s), 45/45 VUs, 375 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m55.8s/3m00.0s

running (1m56.9s), 45/45 VUs, 379 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m56.8s/3m00.0s

running (1m57.9s), 45/45 VUs, 385 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m57.8s/3m00.0s

running (1m58.9s), 45/45 VUs, 390 complete and 0 interrupted iterations
default   [  66% ] 45/45 VUs  1m58.8s/3m00.0s

running (1m59.9s), 45/45 VUs, 391 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  1m59.8s/3m00.0s

running (2m00.9s), 45/45 VUs, 397 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  2m00.8s/3m00.0s

running (2m01.9s), 45/45 VUs, 402 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m01.8s/3m00.0s

running (2m02.9s), 45/45 VUs, 405 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m02.8s/3m00.0s

running (2m03.9s), 45/45 VUs, 413 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m03.8s/3m00.0s

running (2m04.9s), 45/45 VUs, 416 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m04.8s/3m00.0s

running (2m05.9s), 45/45 VUs, 419 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m05.8s/3m00.0s

running (2m06.9s), 45/45 VUs, 422 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m06.8s/3m00.0s

running (2m07.9s), 45/45 VUs, 424 complete and 0 interrupted iterations
default   [  71% ] 45/45 VUs  2m07.8s/3m00.0s

running (2m08.9s), 45/45 VUs, 426 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m08.8s/3m00.0s

running (2m09.9s), 45/45 VUs, 430 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m09.8s/3m00.0s

running (2m10.9s), 45/45 VUs, 435 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m10.8s/3m00.0s

running (2m11.9s), 45/45 VUs, 439 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m11.8s/3m00.0s

running (2m12.9s), 45/45 VUs, 449 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m12.8s/3m00.0s

running (2m13.9s), 45/45 VUs, 454 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m13.8s/3m00.0s

running (2m14.9s), 45/45 VUs, 457 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m14.8s/3m00.0s

running (2m15.9s), 45/45 VUs, 461 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m15.8s/3m00.0s

running (2m16.9s), 45/45 VUs, 465 complete and 0 interrupted iterations
default   [  76% ] 45/45 VUs  2m16.8s/3m00.0s

running (2m17.9s), 45/45 VUs, 470 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m17.8s/3m00.0s

running (2m18.9s), 45/45 VUs, 474 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m18.8s/3m00.0s

running (2m19.9s), 45/45 VUs, 476 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m19.8s/3m00.0s

running (2m20.9s), 45/45 VUs, 480 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m20.8s/3m00.0s

running (2m21.9s), 45/45 VUs, 484 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m21.8s/3m00.0s

running (2m22.9s), 45/45 VUs, 489 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m22.8s/3m00.0s

running (2m23.9s), 45/45 VUs, 494 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m23.8s/3m00.0s

running (2m24.9s), 45/45 VUs, 497 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m24.8s/3m00.0s

running (2m25.9s), 45/45 VUs, 498 complete and 0 interrupted iterations
default   [  81% ] 45/45 VUs  2m25.8s/3m00.0s

running (2m26.9s), 45/45 VUs, 501 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m26.8s/3m00.0s

running (2m27.9s), 45/45 VUs, 508 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m27.8s/3m00.0s

running (2m28.9s), 45/45 VUs, 513 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m28.8s/3m00.0s

running (2m29.9s), 45/45 VUs, 518 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m29.8s/3m00.0s

running (2m30.9s), 45/45 VUs, 520 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m30.8s/3m00.0s

running (2m31.9s), 45/45 VUs, 526 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m31.8s/3m00.0s

running (2m32.9s), 44/45 VUs, 530 complete and 0 interrupted iterations
default   [  85% ] 44/45 VUs  2m32.8s/3m00.0s

running (2m33.9s), 43/45 VUs, 533 complete and 0 interrupted iterations
default   [  85% ] 43/45 VUs  2m33.8s/3m00.0s

running (2m34.9s), 43/45 VUs, 535 complete and 0 interrupted iterations
default   [  86% ] 43/45 VUs  2m34.8s/3m00.0s

running (2m35.9s), 43/45 VUs, 540 complete and 0 interrupted iterations
default   [  87% ] 43/45 VUs  2m35.8s/3m00.0s

running (2m36.9s), 42/45 VUs, 547 complete and 0 interrupted iterations
default   [  87% ] 42/45 VUs  2m36.8s/3m00.0s

running (2m37.9s), 40/45 VUs, 550 complete and 0 interrupted iterations
default   [  88% ] 40/45 VUs  2m37.8s/3m00.0s

running (2m38.9s), 40/45 VUs, 553 complete and 0 interrupted iterations
default   [  88% ] 40/45 VUs  2m38.8s/3m00.0s

running (2m39.9s), 39/45 VUs, 559 complete and 0 interrupted iterations
default   [  89% ] 39/45 VUs  2m39.8s/3m00.0s

running (2m40.9s), 38/45 VUs, 561 complete and 0 interrupted iterations
default   [  89% ] 38/45 VUs  2m40.8s/3m00.0s

running (2m41.9s), 37/45 VUs, 564 complete and 0 interrupted iterations
default   [  90% ] 37/45 VUs  2m41.8s/3m00.0s

running (2m42.9s), 35/45 VUs, 569 complete and 0 interrupted iterations
default   [  90% ] 35/45 VUs  2m42.8s/3m00.0s

running (2m43.9s), 33/45 VUs, 574 complete and 0 interrupted iterations
default   [  91% ] 33/45 VUs  2m43.8s/3m00.0s

running (2m44.9s), 33/45 VUs, 577 complete and 0 interrupted iterations
default   [  92% ] 33/45 VUs  2m44.8s/3m00.0s

running (2m45.9s), 32/45 VUs, 578 complete and 0 interrupted iterations
default   [  92% ] 32/45 VUs  2m45.8s/3m00.0s

running (2m46.9s), 29/45 VUs, 585 complete and 0 interrupted iterations
default   [  93% ] 29/45 VUs  2m46.8s/3m00.0s

running (2m47.9s), 28/45 VUs, 586 complete and 0 interrupted iterations
default   [  93% ] 28/45 VUs  2m47.8s/3m00.0s

running (2m48.9s), 27/45 VUs, 589 complete and 0 interrupted iterations
default   [  94% ] 27/45 VUs  2m48.8s/3m00.0s

running (2m49.9s), 26/45 VUs, 592 complete and 0 interrupted iterations
default   [  94% ] 26/45 VUs  2m49.8s/3m00.0s

running (2m50.9s), 25/45 VUs, 595 complete and 0 interrupted iterations
default   [  95% ] 25/45 VUs  2m50.8s/3m00.0s

running (2m51.9s), 23/45 VUs, 597 complete and 0 interrupted iterations
default   [  95% ] 23/45 VUs  2m51.8s/3m00.0s

running (2m52.9s), 20/45 VUs, 600 complete and 0 interrupted iterations
default   [  96% ] 20/45 VUs  2m52.8s/3m00.0s

running (2m53.9s), 17/45 VUs, 603 complete and 0 interrupted iterations
default   [  97% ] 17/45 VUs  2m53.8s/3m00.0s

running (2m54.9s), 16/45 VUs, 604 complete and 0 interrupted iterations
default   [  97% ] 16/45 VUs  2m54.8s/3m00.0s

running (2m55.9s), 15/45 VUs, 605 complete and 0 interrupted iterations
default   [  98% ] 15/45 VUs  2m55.8s/3m00.0s

running (2m56.9s), 14/45 VUs, 606 complete and 0 interrupted iterations
default   [  98% ] 14/45 VUs  2m56.8s/3m00.0s

running (2m57.9s), 11/45 VUs, 609 complete and 0 interrupted iterations
default   [  99% ] 11/45 VUs  2m57.8s/3m00.0s

running (2m58.9s), 10/45 VUs, 611 complete and 0 interrupted iterations
default   [  99% ] 10/45 VUs  2m58.8s/3m00.0s

running (2m59.9s), 09/45 VUs, 612 complete and 0 interrupted iterations
default   [ 100% ] 09/45 VUs  2m59.8s/3m00.0s

running (3m00.9s), 06/45 VUs, 615 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m01.9s), 06/45 VUs, 615 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m02.9s), 06/45 VUs, 615 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m03.9s), 05/45 VUs, 616 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m04.9s), 03/45 VUs, 618 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m05.9s), 03/45 VUs, 618 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m06.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m07.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m08.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m09.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m10.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m11.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m12.9s), 02/45 VUs, 619 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s

running (3m13.9s), 01/45 VUs, 620 complete and 0 interrupted iterations
default ↓ [ 100% ] 08/45 VUs  3m0s
time="2026-01-14T06:24:46Z" level=info msg="\nCompleted in 194.0s" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=130.12ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.14%

    success_rate
    ✓ 'rate>0.95' rate=99.85%


  █ TOTAL RESULTS 

    checks_total.......: 1382   7.124399/s
    checks_succeeded...: 99.85% 1380 out of 1382
    checks_failed......: 0.14%  2 out of 1382

    ✓ sandbox created
    ✗ shell ok
      ↳  99% — ✓ 816 / ✗ 2
    ✓ python ok

    CUSTOM
    command_latency................: avg=18.1ms  min=3ms    med=13ms    max=1.09s  p(90)=19ms    p(95)=52ms    
    commands_executed..............: 1337   6.892418/s
    errors.........................: 2      0.01031/s
    python_latency.................: avg=17.88ms min=3ms    med=6ms     max=152ms  p(90)=18ms    p(95)=130ms   
    sandbox_create_latency.........: avg=1.19s   min=22ms   med=1.25s   max=1.66s  p(90)=1.64s   p(95)=1.65s   
    success_rate...................: 99.85% 1380 out of 1382

    HTTP
    http_req_duration..............: avg=56.04ms min=1.27ms med=12.69ms max=1.66s  p(90)=18.54ms p(95)=130.12ms
      { expected_response:true }...: avg=56.12ms min=1.27ms med=12.69ms max=1.66s  p(90)=18.55ms p(95)=130.18ms
    http_req_failed................: 0.14%  2 out of 1383
    http_reqs......................: 1383   7.129554/s

    EXECUTION
    iteration_duration.............: avg=11.31s  min=5.05s  med=9.37s   max=30.71s p(90)=21.51s  p(95)=24.88s  
    iterations.....................: 621    3.20134/s
    vus............................: 1      min=1            max=45
    vus_max........................: 45     min=45           max=45

    NETWORK
    data_received..................: 381 kB 2.0 kB/s
    data_sent......................: 315 kB 1.6 kB/s



running (3m14.0s), 00/45 VUs, 621 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/45 VUs  3m0s